app/controllers/lessons_controller.rb

  def find_user
    @user = User.find_by_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1