app/controllers/search_controller.rb

SELECT * FROM "filelists" WHERE ("filelists"."id" = 25)
---
  def index
    @searcher = Searcher.new
    @results = []
    if params[:q]
      #search the index for this query
      query = params[:q]
    elsif params[:search]
      query = params[:search][:q]
    end
    if query
      files = @searcher.query(query)
      files.each do |file|
        hit = [Filelist.find(file[0]), file[1]]