app/controllers/users_controller.rb

  def new
    @user = User.find_by_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('83d34a497febda3c4546108c72452bfb9b7f1b72', '2009-01-16 20:37:40', '7f9dbbfc0913efc0b2c942a9c157267397b187eb', NULL, '2009-01-16 20:37:40', NULL, 'brandon', 'bpollet@gmail.com')